---
kind: property
id: P:Autodesk.Revit.UI.ComboBoxMemberData.Image
source: html/6abb78d3-1f8f-ffe1-95df-61148efb1e2a.htm
---
# Autodesk.Revit.UI.ComboBoxMemberData.Image Property

The image shown on the ComboBoxMember.

## Syntax (C#)
```csharp
public ImageSource Image { get; set; }
```

## Remarks
The image will be shown on the left side of the item when the item is added to a ComboBox.
The best size is 16 x 16 pixels.